docs/src/recent_reading2.zh.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-10-11 Mon 09:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Dipper" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org97e168c">1. 分享最近阅读的书籍清单(二)</a>
<ul>
<li><a href="#org22444cd">1.1. Calculus Made Easy</a></li>
<li><a href="#org0f33000">1.2. How to Design Programs</a></li>
<li><a href="#org320ad93">1.3. Teach Yourself Computer Science</a></li>
<li><a href="#org86ccdfe">1.4. Cambridge English</a></li>
<li><a href="#orgbf5f49b">1.5. 史记的读法－司马迀的历史世界</a></li>
<li><a href="#org5d45794">1.6. Calculus[Gilbert Strang]</a></li>
<li><a href="#orge609d28">1.7. The Science of Functional Programming: A Tutorial, with Examples in Scala</a></li>
<li><a href="#org6047c69">1.8. Introduction to Linear Algebra</a></li>
<li><a href="#org6564e36">1.9. 吕氏春秋</a></li>
<li><a href="#org195367b">1.10. How to Speak</a></li>
</ul>
</li>
<li><a href="#org3114296">2. 写在后面</a></li>
</ul>
</div>
</div>

<div id="outline-container-org97e168c" class="outline-2">
<h2 id="org97e168c"><span class="section-number-2">1</span> 分享最近阅读的书籍清单(二)</h2>
<div class="outline-text-2" id="text-1">
<blockquote>
<p>
吾生也有涯，而知也无涯。以有涯随无涯，殆已！已而为知者，殆而已矣！为善无近名，为恶无近刑，缘督以为经，可以保身，可以全生，可以养亲，可以尽年。
</p>

<p>
－－庄子
</p>
</blockquote>

<p>
这些都是在行业中,历史中或学科中的经典好书或者好内容，我想把这些优秀的东西分享出来，并赋上自己的一些主观想法，
能让更多人知道并从中受益。这里只是做一个引荐，精彩需要你自己亲自拜读从中感受。
</p>
</div>

<div id="outline-container-org22444cd" class="outline-3">
<h3 id="org22444cd"><span class="section-number-3">1.1</span> Calculus Made Easy<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup></h3>
<div class="outline-text-3" id="text-1-1">
<p>
<b>微积分通俗入门</b>
</p>

<blockquote>
<p>
那些认为数学难的人一定没有经历过社会，因为相对于数学的严谨逻辑，似乎这个社会更加复杂。
</p>

<p>
－－有人说
</p>
</blockquote>

<ul class="org-ul">
<li><p>
我的结论
</p>

<p>
因为数学的严谨性，可靠性，近现代科学似乎都是建立在其之上; 1＋1就是等于2不会等于3,也不会等于1; 1＋1&gt;2那是社会学，1+1=1那是人类学;
当你理解了这些之后，你就明白了上面那句引用的意思了。不管是数学公式的推导，还是数学的计算过程，都是逻辑推理出来的不是凭空生成的，
都是有据可寻的。这也就奠定了数学作为科学王冠的地位。而这本《微积分简单入门》用最简单的词汇和最通俗易懂的方法解释微积分。如果你只是小商小
贩，数学的基础运算加减乘除就能满足你了，如果你是工程人员，你可能要学习三角函数线代，如果你是经济相关的，你就需要概率论与数理统计，如果
你是科研，你就要更深的微积分，混沌学。当然这本书只是入门，微积分各个方面他都介绍到了，虽然你可能用不到，很难应用到实践中，但是如果你有
志于更大的理想，数学，微积公都将是你坚不可摧的地基。如果没有，他也可以帮助我们认识这个世界。如果你志力于学习微积分，下面介绍的Gilbert
Strang的微积分是一本不错的全面学习微积分的好书。
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org0f33000" class="outline-3">
<h3 id="org0f33000"><span class="section-number-3">1.2</span> How to Design Programs<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup></h3>
<div class="outline-text-3" id="text-1-2">
<p>
<b>如何设计程序</b>
</p>

<blockquote>
<p>
人人都能设计程序; 每个人都可以体验到创意设计带来的满足感。
</p>

<p>
－－摘要
</p>
</blockquote>

<ul class="org-ul">
<li><p>
我的结论
</p>

<p>
现在我们的每个角落都充斥着程序，各个行业都需要一些编程的技能。而这本书让你系统的了解程序设计，如果你是从业人员，他让你系统的认识程序设计，
少走一些弯路。他认为系统的程序设计就指向两个方面：设计配方和迭代细化。然后在这个基础上细化出5个步聚，遇到问题都可以按照这5个步聚去走，有些
问题可能会出现在一个步聚上或几个步聚上，他也给你了解决方法。或许你刚入这个行业，很多方面不懂，这本书给你一个全局的概念，然后各个细化的内容
你都可以进行简单的衍生，至少不会像无头苍蝇到处碰壁。
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org320ad93" class="outline-3">
<h3 id="org320ad93"><span class="section-number-3">1.3</span> Teach Yourself Computer Science<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup></h3>
<div class="outline-text-3" id="text-1-3">
<p>
<b>自学计算机科学</b>
</p>

<blockquote>
<p>
维护你代码的人就像一个知道你住哪里的暴力精神病患者
</p>

<p>
－－有人说
</p>
</blockquote>

<ul class="org-ul">
<li><p>
我的结论
</p>

<p>
如果你想自学计算机科学，这个是不可多得的好资源。他或许给你的不是最好的方案，但对于没有老师的人他是一个好的路线。也不是绝对的，你可以根据
自己的情况进行增减。现在网络信息如此丰富，以至于你都可以不用去上学了，有人说上学是为了学习社交，可是网络也让社交更简单了，更容易找到志同道
合的伙伴了。如果现代教育系统无法教授更好的知识，那我们又何必浪费时间进入呢。
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org86ccdfe" class="outline-3">
<h3 id="org86ccdfe"><span class="section-number-3">1.4</span> Cambridge English<sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup></h3>
<div class="outline-text-3" id="text-1-4">
<p>
<b>剑桥英语</b>
</p>

<blockquote>
<p>
现代文明知识体系的传播媒介是英语
</p>

<p>
－－共识
</p>
</blockquote>

<ul class="org-ul">
<li><p>
我的结论
</p>

<p>
这是剑桥系列英语，包括语法，词汇，专业词汇，读音系列，每个系列有初级，中级，高级三个级别，他很有实践性，可以用
碎片化的时间学习，他又非常接地气，每个知识点是经常要用到的，每个知识点清晰明了，给你最直接的英语学习。
</p></li>
</ul>
</div>
</div>

<div id="outline-container-orgbf5f49b" class="outline-3">
<h3 id="orgbf5f49b"><span class="section-number-3">1.5</span> 史记的读法－司马迀的历史世界<sup><a id="fnr.5" class="footref" href="#fn.5">5</a></sup></h3>
<div class="outline-text-3" id="text-1-5">
<blockquote>
<p>
天道无亲，常与善人
</p>

<p>
－－或曰
</p>
</blockquote>

<ul class="org-ul">
<li><p>
我的结论
</p>

<p>
从字里行间你能读出什么？尤其是这本集百家之所长的史记。史记中的每篇文章，每个句子，每个字的使用都是有其用意的，而汉语也经过了几千年的变化，其中的词汇
现在你很难知道在当时是什么意思。例如史记上关于楚汉之争有两篇本纪，分别是项羽本纪和高组本纪，高组就是刘邦，那为什么他不直接写刘邦本纪，其中应是有褒贬的，
而项羽直呼其名应是有贬义的。此书建议要读懂史记你要谦虚面对他，不断追问为什么，为什么这里如此写，为什么如此编排，为什么如此难懂，为什么如此简练..。
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org5d45794" class="outline-3">
<h3 id="org5d45794"><span class="section-number-3">1.6</span> Calculus[Gilbert Strang]<sup><a id="fnr.6" class="footref" href="#fn.6">6</a></sup></h3>
<div class="outline-text-3" id="text-1-6">
<p>
<b>微积分</b>
</p>

<blockquote>
<p>
数学是人类智慧王冠上最灿烂的明珠。
</p>

<p>
－－考特
</p>
</blockquote>

<ul class="org-ul">
<li><p>
我的结论
</p>

<p>
一本全面学习微积分的好书。
</p></li>
</ul>
</div>
</div>

<div id="outline-container-orge609d28" class="outline-3">
<h3 id="orge609d28"><span class="section-number-3">1.7</span> The Science of Functional Programming: A Tutorial, with Examples in Scala<sup><a id="fnr.7" class="footref" href="#fn.7">7</a></sup></h3>
<div class="outline-text-3" id="text-1-7">
<p>
<b>函数式编程－用scala语言讲解</b>
</p>

<blockquote>
<p>
我想知道有多少伟大的小说家从来没有读过别人的作品，有多少伟大的画家从来没有研究过别人的笔触，有多少熟练的外科医生从来没有从同事的肩膀上学过……然而，这就是我们期望程序员做的事情。
</p>

<p>
－－戴夫·托马斯
</p>
</blockquote>

<ul class="org-ul">
<li><p>
我的结论
</p>

<p>
面向对象编程(OOP)似乎更适用于UI方面，函数编程(FP)适用于大型软件，因为你的代码都是一个个函数，而函数又是数学，所以几乎没有BUG的生存空间。
要深入了解FP编程还是要一定的学习成本的，里面也有一些复杂的技术。这本书直接以大量的练习方式学习FP，他要求要有一定的数学代数知识和努力。
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org6047c69" class="outline-3">
<h3 id="org6047c69"><span class="section-number-3">1.8</span> Introduction to Linear Algebra<sup><a id="fnr.8" class="footref" href="#fn.8">8</a></sup></h3>
<div class="outline-text-3" id="text-1-8">
<p>
<b>线性代数</b>
</p>

<blockquote>
<p>
纯数学是“p蕴涵q”形式的所有命题的类，其中p和q是包含一个或多个变量的命题，两个命题中相同，并且p和q都不包含除逻辑常数之外的任何常数。和逻辑 常量是所有可以用以下术语定义的概念：蕴涵，一个术语与它所属的类的关系，这样的概念，关系的概念，以及可能涉及一般概念的其他概念 上述形式的命题的概念。除此之外，数学还使用一个不是它所考虑的命题的组成部分的概念，即真概念。
</p>

<p>
－－伯特兰·罗素
</p>
</blockquote>

<ul class="org-ul">
<li><p>
我的结论
</p>

<p>
这是MIT基础线性代数公开课，还有配套的教材<sup><a id="fnr.9" class="footref" href="#fn.9">9</a></sup>; 线性代数是关于线性方程，空间向量的一个数学分支，例如 x + y = z等是一个线性方程;
这门公开课可以说是目前为止线上最好的线性代数公开课之一，不管你是学生，老师，上班族还是无业人士，你都可以学习这门课程，让自己的学识
上升一个层次。线性代数也是高级别工作，研究，科研的敲门砖，想做高级工作就要学好线代，要不然你只能在浅滩上拍水，无法深入大海中
遨游。
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org6564e36" class="outline-3">
<h3 id="org6564e36"><span class="section-number-3">1.9</span> 吕氏春秋<sup><a id="fnr.10" class="footref" href="#fn.10">10</a></sup></h3>
<div class="outline-text-3" id="text-1-9">
<blockquote>
<p>
故周公旦曰：“不如吾者，吾不与处，累我者也；与我齐者，吾不与处，无益我者也。惟贤者必与贤於己者处。贤者之可得与处也，礼之也。&#x2026;”
</p>

<p>
&#x2013;吕氏春秋.观世览
</p>
</blockquote>

<ul class="org-ul">
<li><p>
我的结论
</p>

<p>
一字千金的典故出自这本书。中国自古贬低商人，士农工商，商人排最后，有商人重利轻别离; 而大商人往往都要依附于权力，吕不韦将经商与权力都做到的极致;
经商投资了秦国，权力位至相国，更是编撰了吕氏春秋成一家之言。中国过去五千年富贾巨商千万，而吕不韦因为这本书被流传至今，就像孔子说的：
后世知丘者以春秋，而罪丘者亦以春秋。
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org195367b" class="outline-3">
<h3 id="org195367b"><span class="section-number-3">1.10</span> How to Speak<sup><a id="fnr.11" class="footref" href="#fn.11">11</a></sup></h3>
<div class="outline-text-3" id="text-1-10">
<p>
<b>说话的艺术</b>
</p>

<blockquote>
<p>
在接下来的60分钟中，您将接触到很多想法，其中一些您将融入到自己的生活中，它们将确保您有最大的机会让您的听众重视和接受您的想法。
</p>

<p>
&#x2013;帕特里克·温斯顿
</p>
</blockquote>

<ul class="org-ul">
<li><p>
我的结论
</p>

<p>
这是MIT一节非常著名的公开课，如何在约会，演说，饭局，聚会中给人留下深刻印象？ 首先一开始你就要做一个保证，保证自己接下来的说话能带来有意义的内容，
例如这次谈话我将让你认识到说话顺序的重要性，一次好的说话能让你与重不同，说话的顺序也很重要，你不能以开玩笑开场，因为刚开始是大家注意力最集中的时候，
你不能错过这么好的时机，讲一些跟内容没有关系的东西，当然你可以以一个笑话结束，暗示大家快结束了可以放松了;重要的内容要在说话中重复三次左右，
因为这样才能让人记住重要的内容。演说的最后也不要说什么谢谢之类的感谢话，以一个深意的话做结尾给人留下意犹未尽和遐想。例如美国总统就职演说中，
不是以谢谢结束，他们不会说Thank You, 而是God bless you, God bless America.
</p></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org3114296" class="outline-2">
<h2 id="org3114296"><span class="section-number-2">2</span> 写在后面</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li><a href="https://github.com/tiglapiles/article/blob/master/recent_reading.org">分享最近阅读的书籍清单（一）</a></li>
<li><a href="https://github.com/tiglapiles/article">本文地址</a></li>
<li>如果你想访问更多我的文章欢迎访问我的<a href="https://github.com/tiglapiles/article">github仓库</a></li>
<li>捐助我的<a href="https://itch.io/profile/tiglapiles">游戏</a>(定期上新)，支持我的创作</li>
<li>转载请注明出处</li>
<li><a href="https://www.v2ex.com/t/805027">社区更新地址</a></li>
</ol>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="https://calculusmadeeasy.org/">https://calculusmadeeasy.org/</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
<a href="https://htdp.org/">https://htdp.org/</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
<a href="https://teachyourselfcs.com/">https://teachyourselfcs.com/</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4">4</a></sup> <div class="footpara"><p class="footpara">
<a href="https://book.douban.com/subject/1232201/">https://book.douban.com/subject/1232201/</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.5" class="footnum" href="#fnr.5">5</a></sup> <div class="footpara"><p class="footpara">
<a href="https://book.douban.com/subject/34781358/">https://book.douban.com/subject/34781358/</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.6" class="footnum" href="#fnr.6">6</a></sup> <div class="footpara"><p class="footpara">
<a href="https://book.douban.com/subject/30459914/">https://book.douban.com/subject/30459914/</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.7" class="footnum" href="#fnr.7">7</a></sup> <div class="footpara"><p class="footpara">
<a href="https://github.com/winitzki/sofp">https://github.com/winitzki/sofp</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.8" class="footnum" href="#fnr.8">8</a></sup> <div class="footpara"><p class="footpara">
<a href="https://ocw.mit.edu/courses/mathematics/18-06-linear-algebra-spring-2010/video-lectures/">https://ocw.mit.edu/courses/mathematics/18-06-linear-algebra-spring-2010/video-lectures/</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.9" class="footnum" href="#fnr.9">9</a></sup> <div class="footpara"><p class="footpara">
<a href="https://book.douban.com/subject/3582335/">https://book.douban.com/subject/3582335/</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.10" class="footnum" href="#fnr.10">10</a></sup> <div class="footpara"><p class="footpara">
<a href="https://book.douban.com/subject/2053608/">https://book.douban.com/subject/2053608/</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.11" class="footnum" href="#fnr.11">11</a></sup> <div class="footpara"><p class="footpara">
<a href="https://ocw.mit.edu/resources/res-tll-005-how-to-speak-january-iap-2018/how-to-speak/index.htm">https://ocw.mit.edu/resources/res-tll-005-how-to-speak-january-iap-2018/how-to-speak/index.htm</a>
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Dipper</p>
<p class="date">Created: 2021-10-11 Mon 09:46</p>
</div>
</body>
</html>
