src/share_it/recent_reading2.zh.md

# Table of Contents

1.  [分享最近阅读的书籍清单(二)](#orgb9e50e2)
    1.  [Calculus Made Easy](#orgf185ff3)
    2.  [How to Design Programs](#org84a2a6c)
    3.  [Teach Yourself Computer Science](#orgb95d246)
    4.  [Cambridge English](#org2d103db)
    5.  [史记的读法－司马迀的历史世界](#org2d68ee0)
    6.  [Calculus[Gilbert Strang]](#org373f722)
    7.  [The Science of Functional Programming: A Tutorial, with Examples in Scala](#org234bdc5)
    8.  [Introduction to Linear Algebra](#orge051193)
    9.  [吕氏春秋](#org2f7f28b)
    10. [How to Speak](#orgb3ad631)
2.  [写在后面](#orga3aa189)



<a id="orgb9e50e2"></a>

# 分享最近阅读的书籍清单(二)

> 吾生也有涯，而知也无涯。以有涯随无涯，殆已！已而为知者，殆而已矣！为善无近名，为恶无近刑，缘督以为经，可以保身，可以全生，可以养亲，可以尽年。
> 
> &#x2013;庄子

这些都是在行业中,历史中或学科中的经典好书或者好内容，我想把这些优秀的东西分享出来，并赋上自己的一些主观想法，能让更多人知道并从中受益。这里只是做一个引荐，精彩需要你自己亲自拜读从中感受。


<a id="orgf185ff3"></a>

## Calculus Made Easy<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>

**微积分通俗入门**

> 那些认为数学难的人一定没有经历过社会，因为相对于数学的严谨逻辑，似乎这个社会更加复杂。
> 
> &#x2013;有人说

-   我的结论
    
    因为数学的严谨性，可靠性，近现代科学似乎都是建立在其之上; 1＋1就是等于2不会等于3,也不会等于1; 1＋1>2那是社会学，1+1=1那是人类学;当你理解了这些之后，你就明白了上面那句引用的意思了。不管是数学公式的推导，还是数学的计算过程，都是逻辑推理出来的不是凭空生成的，都是有据可寻的。这也就奠定了数学作为科学王冠的地位。而这本《微积分简单入门》用最简单的词汇和最通俗易懂的方法解释微积分。如果你只是小商小贩，数学的基础运算加减乘除就能满足你了，如果你是工程人员，你可能要学习三角函数线代，如果你是经济相关的，你就需要概率论与数理统计，如果你是科研，你就要更深的微积分，混沌学。当然这本书只是入门，微积分各个方面他都介绍到了，虽然你可能用不到，很难应用到实践中，但是如果你有志于更大的理想，数学，微积公都将是你坚不可摧的地基。如果没有，他也可以帮助我们认识这个世界。如果你志力于学习微积分，下面介绍的Gilbert Strang的微积分是一本不错的全面学习微积分的好书。


<a id="org84a2a6c"></a>

## How to Design Programs<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>

**如何设计程序**

> 人人都能设计程序; 每个人都可以体验到创意设计带来的满足感。
> 
> &#x2013;摘要

-   我的结论
    
    现在我们的每个角落都充斥着程序，各个行业都需要一些编程的技能。而这本书让你系统的了解程序设计，如果你是从业人员，他让你系统的认识程序设计，少走一些弯路。他认为系统的程序设计就指向两个方面：设计配方和迭代细化。然后在这个基础上细化出5个步聚，遇到问题都可以按照这5个步聚去走，有些问题可能会出现在一个步聚上或几个步聚上，他也给你了解决方法。或许你刚入这个行业，很多方面不懂，这本书给你一个全局的概念，然后各个细化的内容你都可以进行简单的衍生，至少不会像无头苍蝇到处碰壁。


<a id="orgb95d246"></a>

## Teach Yourself Computer Science<sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup>

**自学计算机科学**

> 维护你代码的人就像一个知道你住哪里的暴力精神病患者
> 
> &#x2013;有人说

-   我的结论
    
    如果你想自学计算机科学，这个是不可多得的好资源。他或许给你的不是最好的方案，但对于没有老师的人他是一个好的路线。也不是绝对的，你可以根据自己的情况进行增减。现在网络信息如此丰富，以至于你都可以不用去上学了，有人说上学是为了学习社交，可是网络也让社交更简单了，更容易找到志同道合的伙伴了。如果现代教育系统无法教授更好的知识，那我们又何必浪费时间进入呢。


<a id="org2d103db"></a>

## Cambridge English<sup><a id="fnr.4" class="footref" href="#fn.4" role="doc-backlink">4</a></sup>

**剑桥英语**

> 现代文明知识体系的传播媒介是英语
> 
> &#x2013;共识

-   我的结论
    
    这是剑桥系列英语，包括语法，词汇，专业词汇，读音系列，每个系列有初级，中级，高级三个级别，他很有实践性，可以用碎片化的时间学习，他又非常接地气，每个知识点是经常要用到的，每个知识点清晰明了，给你最直接的英语学习。


<a id="org2d68ee0"></a>

## 史记的读法－司马迀的历史世界<sup><a id="fnr.5" class="footref" href="#fn.5" role="doc-backlink">5</a></sup>

> 天道无亲，常与善人
> 
> &#x2013;或曰

-   我的结论
    
    从字里行间你能读出什么？尤其是这本集百家之所长的史记。史记中的每篇文章，每个句子，每个字的使用都是有其用意的，而汉语也经过了几千年的变化，其中的词汇现在你很难知道在当时是什么意思。例如史记上关于楚汉之争有两篇本纪，分别是项羽本纪和高组本纪，高组就是刘邦，那为什么他不直接写刘邦本纪，其中应是有褒贬的，而项羽直呼其名应是有贬义的。此书建议要读懂史记你要谦虚面对他，不断追问为什么，为什么这里如此写，为什么如此编排，为什么如此难懂，为什么如此简练..。


<a id="org373f722"></a>

## Calculus[Gilbert Strang]<sup><a id="fnr.6" class="footref" href="#fn.6" role="doc-backlink">6</a></sup>

**微积分**

> 数学是人类智慧王冠上最灿烂的明珠。
> 
> &#x2013;考特

-   我的结论
    
    一本全面学习微积分的好书。


<a id="org234bdc5"></a>

## The Science of Functional Programming: A Tutorial, with Examples in Scala<sup><a id="fnr.7" class="footref" href="#fn.7" role="doc-backlink">7</a></sup>

**函数式编程－用scala语言讲解**

> 我想知道有多少伟大的小说家从来没有读过别人的作品，有多少伟大的画家从来没有研究过别人的笔触，有多少熟练的外科医生从来没有从同事的肩膀上学过……然而，这就是我们期望程序员做的事情。
> 
> &#x2013;戴夫·托马斯

-   我的结论
    
    面向对象编程(OOP)似乎更适用于UI方面，函数编程(FP)适用于大型软件，因为你的代码都是一个个函数，而函数又是数学，所以几乎没有BUG的生存空间。要深入了解FP编程还是要一定的学习成本的，里面也有一些复杂的技术。这本书直接以大量的练习方式学习FP，他要求要有一定的数学代数知识和努力。


<a id="orge051193"></a>

## Introduction to Linear Algebra<sup><a id="fnr.8" class="footref" href="#fn.8" role="doc-backlink">8</a></sup>

**线性代数**

> 纯数学是“p蕴涵q”形式的所有命题的类，其中p和q是包含一个或多个变量的命题，两个命题中相同，并且p和q都不包含除逻辑常数之外的任何常数。和逻辑 常量是所有可以用以下术语定义的概念：蕴涵，一个术语与它所属的类的关系，这样的概念，关系的概念，以及可能涉及一般概念的其他概念 上述形式的命题的概念。除此之外，数学还使用一个不是它所考虑的命题的组成部分的概念，即真概念。
> 
> &#x2013;伯特兰·罗素

-   我的结论
    
    这是MIT基础线性代数公开课，还有配套的教材<sup><a id="fnr.9" class="footref" href="#fn.9" role="doc-backlink">9</a></sup>; 线性代数是关于线性方程，空间向量的一个数学分支，例如 x + y = z等是一个线性方程;这门公开课可以说是目前为止线上最好的线性代数公开课之一，不管你是学生，老师，上班族还是无业人士，你都可以学习这门课程，让自己的学识上升一个层次。线性代数也是高级别工作，研究，科研的敲门砖，想做高级工作就要学好线代，要不然你只能在浅滩上拍水，无法深入大海中遨游。


<a id="org2f7f28b"></a>

## 吕氏春秋<sup><a id="fnr.10" class="footref" href="#fn.10" role="doc-backlink">10</a></sup>

> 故周公旦曰：“不如吾者，吾不与处，累我者也；与我齐者，吾不与处，无益我者也。惟贤者必与贤於己者处。贤者之可得与处也，礼之也。&#x2026;”
> 
> &#x2013;吕氏春秋.观世览

-   我的结论
    
    一字千金的典故出自这本书。中国自古贬低商人，士农工商，商人排最后，有商人重利轻别离; 而大商人往往都要依附于权力，吕不韦将经商与权力都做到的极致;经商投资了秦国，权力位至相国，更是编撰了吕氏春秋成一家之言。中国过去五千年富贾巨商千万，而吕不韦因为这本书被流传至今，就像孔子说的：后世知丘者以春秋，而罪丘者亦以春秋。


<a id="orgb3ad631"></a>

## How to Speak<sup><a id="fnr.11" class="footref" href="#fn.11" role="doc-backlink">11</a></sup>

**说话的艺术**

> 在接下来的60分钟中，您将接触到很多想法，其中一些您将融入到自己的生活中，它们将确保您有最大的机会让您的听众重视和接受您的想法。
> 
> &#x2013;帕特里克·温斯顿

-   我的结论
    
    这是MIT一节非常著名的公开课，如何在约会，演说，饭局，聚会中给人留下深刻印象？ 首先一开始你就要做一个保证，保证自己接下来的说话能带来有意义的内容，例如这次谈话我将让你认识到说话顺序的重要性，一次好的说话能让你与重不同，说话的顺序也很重要，你不能以开玩笑开场，因为刚开始是大家注意力最集中的时候，你不能错过这么好的时机，讲一些跟内容没有关系的东西，当然你可以以一个笑话结束，暗示大家快结束了可以放松了;重要的内容要在说话中重复三次左右，因为这样才能让人记住重要的内容。演说的最后也不要说什么谢谢之类的感谢话，以一个深意的话做结尾给人留下意犹未尽和遐想。例如美国总统就职演说中，不是以谢谢结束，他们不会说Thank You, 而是God bless you, God bless America.


<a id="orga3aa189"></a>

# 写在后面

<table id="org71298a1" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">NO.</th>
<th scope="col" class="org-left">Content</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left"><a href="https://tiglapiles.github.io/article/src/share_it/recent_reading.html">分享最近阅读的书籍清单(一)</a></td>
</tr>


<tr>
<td class="org-right">2</td>
<td class="org-left"><a href="https://tiglapiles.github.io/article/src/share_it/recent_reading2.zh.html">分享最近阅读的书籍清单(二)</a></td>
</tr>


<tr>
<td class="org-right">3</td>
<td class="org-left"><a href="https://tiglapiles.github.io/article/src/share_it/recent_reading3.zh.html">分享最近阅读的书籍清单(三)</a></td>
</tr>


<tr>
<td class="org-right">4</td>
<td class="org-left"><a href="https://tiglapiles.github.io/article/src/build_it/how_face_midnight.html">如何面对35岁</a></td>
</tr>


<tr>
<td class="org-right">5</td>
<td class="org-left"><a href="https://tiglapiles.github.io/article/src/share_it/recent_reading4.zh.html">分享最近阅读的书籍清单(四)</a></td>
</tr>


<tr>
<td class="org-right">6</td>
<td class="org-left"><a href="https://tiglapiles.github.io/article/src/build_it/why_you_should_learn_several_programming_language_and_where_to_learn_them.html">为什么你应该学习多种语言及哪里可以学到他们</a></td>
</tr>


<tr>
<td class="org-right">7</td>
<td class="org-left"><a href="https://tiglapiles.github.io/article/src/build_it/older_developer.zh.html">作为大龄程序员，你如何持续的保持自己的竞争优势</a></td>
</tr>


<tr>
<td class="org-right">8</td>
<td class="org-left">如果喜欢该文章欢迎Star我的<a href="https://github.com/tiglapiles/article">github</a></td>
</tr>


<tr>
<td class="org-right">9</td>
<td class="org-left">捐助我的<a href="https://itch.io/profile/tiglapiles">游戏</a>，支持我的创作</td>
</tr>


<tr>
<td class="org-right">10</td>
<td class="org-left"><a href="https://v2ex.com/t/884436">社区更新地址</a></td>
</tr>


<tr>
<td class="org-right">11</td>
<td class="org-left">email: <a href="mailto:tiglapiles@gmail.com">tiglapiles@gmail.com</a></td>
</tr>
</tbody>
</table>


# Footnotes

<sup><a id="fn.1" href="#fnr.1">1</a></sup> <https://calculusmadeeasy.org/>

<sup><a id="fn.2" href="#fnr.2">2</a></sup> <https://htdp.org/>

<sup><a id="fn.3" href="#fnr.3">3</a></sup> <https://teachyourselfcs.com/>

<sup><a id="fn.4" href="#fnr.4">4</a></sup> <https://book.douban.com/subject/1232201/>

<sup><a id="fn.5" href="#fnr.5">5</a></sup> <https://book.douban.com/subject/34781358/>

<sup><a id="fn.6" href="#fnr.6">6</a></sup> <https://book.douban.com/subject/30459914/>

<sup><a id="fn.7" href="#fnr.7">7</a></sup> <https://github.com/winitzki/sofp>

<sup><a id="fn.8" href="#fnr.8">8</a></sup> <https://ocw.mit.edu/courses/mathematics/18-06-linear-algebra-spring-2010/video-lectures/>

<sup><a id="fn.9" href="#fnr.9">9</a></sup> <https://book.douban.com/subject/3582335/>

<sup><a id="fn.10" href="#fnr.10">10</a></sup> <https://book.douban.com/subject/2053608/>

<sup><a id="fn.11" href="#fnr.11">11</a></sup> <https://ocw.mit.edu/resources/res-tll-005-how-to-speak-january-iap-2018/how-to-speak/index.htm>
